<?php
 /**
 *  Project: Cooltey.org
 *  Last Modified Date: 2017 Jan
 *  Developer: Cooltey Feng
 *  File: ./parts/about_page.php
 *  Description: About Page
 */
?>

    <div class="container">
      <!-- Example row of columns -->
      <div class="row">

        <div class="col-md-12">
          <!-- Bread Crumb -->
          <ol class="breadcrumb">
            <li><a href="./">首頁</a></li>
            <li class="active">站長介紹</li>
          </ol>

          <!-- List Content -->
          <div class="row about">
            
            <div class="col-md-4">
              <h4>站長是誰呢？</h4>
              站長是一位平凡的人，目前人在美國
            </div>
            <div class="col-md-4">
              <h4>架站歷史</h4>
                <li>  
                  2016: 網站改版，拿掉舊東西，改成手機版也能用的網站
                </li>
                <li>  
                  2011: 建立分站，大幅改版
                </li>
                <li>  
                  2010: 加入網友審核專區 
                </li>
                <li>  
                  2008: 網站全面改用 PHP + Mysql 資料庫顯示
                </li>
                <li>  
                  2007: 將網站從框架式(Frame)改成全頁式
                </li>
                <li>
                  2006: 採用上下框架式網頁
                </li>
                <li>
                  2004: 網站加入了 Flash 選單動畫，並加入 GBA 遊戲
                </li>
                <li>
                  2001: 進行網頁版面調整，改成非框架式
                </li>
                <li>
                  2000.02.05: 站長生日當天，建立網站
                </li>
            </div>
            <div class="col-md-4">
              <h4>站長囧問答</h4>
              Q1：站長的本名是？？<p>A1：這當然就不便透露了，不過在程式設計區的程式中可以發現我的本名就是了。</p>
                <p>Q2：站長是男是女？</p>
                <p>A2：男，普通人</p>
                <p>Q3：站長你幾歲？</p>
                <p>A3：今年 <?php echo round((time()-strtotime("1987-02-05"))/(24*60*60)/365.25,0)-1;?> 歲囉！</p>
                <p>Q4：站長有把網站的遊戲都破關嗎？</p>
                <p>A4：你覺得這有可能嗎？</p>
                <p>Q5：站長很會玩遊戲嗎？</p>
                <p>A5：不算是很會玩，但是很喜歡玩遊戲就是了。</p>
                <p>Q6：站長可以幫我找遊戲嗎？</p>
                <p>A6：當然是不行。</p>
                <p>Q7：當初你設計這個網站是為了什麼？</p>
                <p>
                A7：當初是因為自己沒有掌上型主機，然後看著網路上有流傳許多好玩的模擬器遊戲，看著看著，自己也想做個網站來分享給大家，後來就是現在的平水相逢了。</p>
                <p>Q8：站長你有收過什麼樣的信件？</p>
                <p>A8：我收過很多鼓勵的信，找遊戲的信，找攻略金手指，還有信件都是一堆髒話的。</p>
                <p>Q9：這個網站一個月可以收多少廣告費？</p>
                <p>A9：這不方便講</p>
                <p>Q10：經營一個網站會很難嗎？</p>
                <p>A10：其實一點都不難，只要常常更新網站，做好網站規劃，自然人氣會高。</p>
                <p>Q11：那我想要做網站要怎麼做？</p>
                <p>A11：看看電腦有沒有FrontPage 或是 Dreamwaver 
                之類的網頁製作程式，再配合一些市面上販賣的書籍，就可以輕鬆製作一個簡單的網站喔。</p>
                <p>Q12：站長有想過要關站嗎？</p>
                <p>A12：有，不過是在好幾年前。</p>
                <p>Q13：那站長現在讀哪間大學？</p>
                <p>A13：台灣的淡江大學，私立，現在畢業囉！</p>
                <p>Q14：站長每介紹一款新遊戲需要花多少時間？</p>
                <p>A14：其實不會很久，從抓遊戲，抓圖片，到介紹遊戲，差不多要1小時就好了。</p>
                <p>Q15：那站長覺得經營這個網站是你的工作嗎？</p>
                <p>A15：當然不是工作，而是興趣。</p>
                <p>Q16：站長到底是台灣人還是香港人？</p>
                <p>A16：這是個非常好的問題，站長是台灣人。只是不知道為什麼Yahoo!香港分類的為什麼會把我分類到香港網站類別就是了。</p>
                <p>Q17：站長是宅男嗎？</p>
                <p>A17：站長絕對不是宅男。</p>
                <p>Q18：站長有交女朋友嗎？</p>
                <p>A18：站長已經有交了一個超可愛的女朋友囉！</p>
                <p>Q19：站長有出過國嗎？</p>
                <p>A19：有！2008年在美國加州留學一年，是個非常好的經驗。現在人正在美國！(2016)</p>
                <p>Q20：平水相逢開站以來有遇過什麼有趣的事情？</p>
                <p>A20：像是站長無緣無故收到網友詢問像是「XXX是不是你的表弟」或是「老師你好」之類的。站長並沒有這麼多表弟，而且站長也不是老師。</p>
                <p>Q21：站長家到底有幾隻小狗？</p>
                <p>A21：現在苗栗老家有四隻小狗，我自己身邊則是有兩隻</p>
                <p>Q22：平水相逢到底什麼時候才會有會員註冊的功能</p>
                <p>A22：已經有了XD</p>
                <p>Q23：站長辦活動到底花了多少錢阿？錢從哪裡來的？</p>
                <p>A23：辦活動花多少錢當然是個秘密，不過這些經費都是從網站收入取出來的，所以辦活動也算是個回饋囉</p>
                <p>Q24：為什麼站長不放自己的照片？？</p>
                <p>A24：因為站長害羞>///<</p>
                <p>Q25：平水相逢內的會員系統都是你自己製作的嗎？</p>
                <p>A25：沒錯，花了我非常多的時間</p>
                <p>Q26：站長有禿頭嗎？</p>
                <p>A26：怎麼可能禿頭。</p>
                <p>Q27：今後還會新增更多小狗的照片嗎？</p>
                <p>A27：有可能喔！如果站長想放的話。</p>
                <p>Q28：平水相逢到底經營幾年了？</p>
                <p>A28：已經十六年了，算是個老網站囉。</p>
                <p>Q29：為什麼要叫「平水相逢」而不是「『萍』水相逢</p>
                <p>A29：因為在以前建立這個網站的時候，當時班上是「平」班，再加上班級導師是國文老師，所以就取了這麼樣的一個網站名稱囉！</p>
                <p>Q30：今後還會有什麼更新的功能嗎？</p>
                <p>A30：一定會有的，所以請繼續支持平水相逢。</p>
                <p>Q31：為什麼有時候都沒有更新網站？</p>
                <p>A31：因為現在站長在當兵囉，要報效國家一年。（已退伍）</p>
                <p>Q32：那當兵好玩嗎？</p>
                <p>A32：基本上來說是不好玩的，但是還是得當囉。</p>
                <p>Q33：那這樣多久會更新一次阿？</p>
                <p>A33：站長兩個禮拜會放假回家，所以通常都是兩個禮拜更新一次。</p>
                <p>Q34：站長有玩 Facebook 嗎？</p>
                <p>A34：有喔～可以在上面的地方找到站長的 Facebook 名片。</p>
                <p>Q35：那站長有玩噗浪（Plurk）嗎？</p>
                <p>A35：當然也有，也是同樣可以在上面找到站長的噗浪。（已沒玩）</p>
                <p>Q36：站長有用 Yahoo!即時通嗎？</p>
                <p>A36：以前有，再沒有了。現在都是以 MSN 為主囉。（現在都用 Facebook）</p>
                <p>Q37：站長每次更新都會花多久的時間阿？</p>
                <p>A37：每次幾乎都半小時以上，找遊戲或是新增多款遊戲就會更久喔。</p>
                <p>Q38：那這樣有考慮要新增副站長嗎？</p>
                <p>A38：目前尚無這個打算，不過倒是蠻想有人幫我分擔一些工作的。</p>
                <p>Q39：以後還會有抽獎活動嗎？</p>
                <p>A39：可能會有喔，要等站長超閒的時候</p>
                <p>Q40：問這麼多問題，站長會煩嗎？</p>
                <p>A40：好問題，應該是不會煩。</p>
                <p>Q41：站長最喜歡玩甚麼類型的遊戲？</p>
                <p>A41：站長最喜歡玩動作冒險的遊戲！</p>
                <p>Q42：為什麼站長現在有上班還可以天天更新網站，還順便改版？</p>
                <p>A42：因為站長拚了！</p>
                <p>Q43：如果我也對寫程式、作網站，那這樣我該怎麼辦？ </p>
                <p>A43：買本書、認真讀書，偶爾上上平水相逢就對囉！</p>
                <p>Q44：站長上班會很累嗎？  </p>
                <p>A44：老實說，真的超累的。</p>
                <p>Q45：這次的大改版花了站長多久的時間？（2011） </p>
                <p>A45：應該快要一年...(羞)</p>
                <p>Q46：什麼是 RWD ？ </p>
                <p>A46：也就是響應式網頁，現在的網站就可以用手機看也不會跑版囉</p>

            </div>


          </div>

          

        </div>
      </div>